app/serializers/item_serializer.rb

  def storage
    {storage_id: self.object.storage.id,
     storage_name: self.object.storage.name,
    storage_size: self.object.storage.size,
    storage_photo: self.object.storage.photo}
---
SELECT "storages".* FROM "storages" WHERE "storages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]