app/serializers/room_serializer.rb

  def storages
    self.object.storages.map do |storage|
---
SELECT "storages".* FROM "storages" WHERE "storages"."room_id" = $1  [["room_id", 1]]