app/serializers/storage_serializer.rb

SELECT "items".* FROM "items" WHERE "items"."storage_id" = $1  [["storage_id", 1]]
---
  def items
    self.object.items.map do |item|