app/serializers/user_serializer.rb

  def rooms
    self.object.rooms.map do |room|
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."user_id" = $1  [["user_id", 1]]