app/controllers/api/v1/items_controller.rb

SELECT "items".* FROM "items"
---
    def index
        items = Item.all

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        item = Item.find(params[:id])

INSERT INTO "items" ("name", "category", "quantity", "description", "photo", "created_at", "updated_at", "storage_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        item = Item.create(item_params)

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def update
        item = Item.find(params[:id])