app/controllers/api/v1/storages_controller.rb

    def index
        storages = Storage.all
---
SELECT "storages".* FROM "storages"

    def show
        storage = Storage.find(params[:id])
---
SELECT "storages".* FROM "storages" WHERE "storages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        storage = Storage.find(params[:id])
        storage.update(storage_params)
---
SELECT "storages".* FROM "storages" WHERE "storages"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "storages" SET "size" = $1, "updated_at" = $2 WHERE "storages"."id" = $3  [["size", "large"], ["updated_at", "2020-03-26 21:32:04.354161"], ["id", 2]]