app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Bookshelf"], ["updated_at", "2020-03-26 21:32:25.151379"], ["id", 2]]
---
    def update
        @user = User.find(params[:id])
        if @user.valid?
            @user.update(plant_params)